{
    "version": "https://jsonfeed.org/version/1",
    "title": "Chris Basson",
    "description": "",
    "home_page_url": "https://chris.basson.io",
    "feed_url": "https://chris.basson.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Chris Basson"
    },
    "items": [
        {
            "id": "https://chris.basson.io/not-all-transparency-is-created-equal.html",
            "url": "https://chris.basson.io/not-all-transparency-is-created-equal.html",
            "title": "Not All Transparency is Created Equal",
            "summary": "Fireplace vs Fridge: What Companies Really Mean When They Say \"Transparency\" Transparency&hellip;",
            "content_html": "<h3 data-start=\"147\" data-end=\"227\"><strong data-start=\"147\" data-end=\"227\">Fireplace vs Fridge: What Companies Really Mean When They Say \"Transparency\"</strong></h3>\n<p class=\"\" data-start=\"229\" data-end=\"435\">Transparency is one of those values that shows up on almost every company page. It sounds good, feels progressive, and looks great in onboarding slides. But in practice, not all transparency feels the same.</p>\n<p class=\"\" data-start=\"437\" data-end=\"551\">Over time, I’ve come to think of it in two distinct forms: <strong data-start=\"496\" data-end=\"519\">fridge transparency</strong> and <strong data-start=\"524\" data-end=\"550\">fireplace transparency</strong>.</p>\n<hr class=\"\" data-start=\"553\" data-end=\"556\">\n<h3 class=\"\" data-start=\"558\" data-end=\"581\">Fridge Transparency</h3>\n<p class=\"\" data-start=\"583\" data-end=\"710\">Fridge transparency is technically open. The documents exist. The strategy deck is in a folder. The numbers are in a dashboard.</p>\n<p class=\"\" data-start=\"712\" data-end=\"789\">But like a fridge, it only works if you get up, walk over, and open the door.</p>\n<p class=\"\" data-start=\"791\" data-end=\"970\">The information is cold, compartmentalised, and out of the way. You have to know what you're looking for. You have to choose to go searching. You have to take action to access it.</p>\n<p class=\"\" data-start=\"972\" data-end=\"1209\">This version of transparency often comes from good intentions. The idea is to make things visible. But the burden sits entirely with the individual. It assumes that everyone knows where to look, what matters, and how to connect the dots.</p>\n<p class=\"\" data-start=\"1211\" data-end=\"1416\">In reality, most people don’t. Especially if they’re new to the team, less confident, or just overwhelmed with their own work. The result is a kind of passive transparency that excludes without meaning to.</p>\n<p data-start=\"1211\" data-end=\"1416\">Fridge transparency is cheap to create and easy to maintain, but its impact is just as shallow. It demands little effort and offers little in return.</p>\n<hr class=\"\" data-start=\"1418\" data-end=\"1421\">\n<h3 class=\"\" data-start=\"1423\" data-end=\"1449\">Fireplace Transparency</h3>\n<p class=\"\" data-start=\"1451\" data-end=\"1495\">Fireplace transparency feels very different.</p>\n<p class=\"\" data-start=\"1497\" data-end=\"1564\">It is warm. It is present. You feel it simply by being in the room.</p>\n<p class=\"\" data-start=\"1566\" data-end=\"1683\">You do not need to take action to benefit from it. You are already exposed to the heat. The transparency reaches you.</p>\n<p class=\"\" data-start=\"1685\" data-end=\"1938\">This kind of transparency is built intentionally. It shows up in the habits and systems of a team. Decisions are documented, shared and explained. Strategy is repeated often. Metrics are walked through, not just published. Important context is broadcast by default.</p>\n<p class=\"\" data-start=\"1940\" data-end=\"2009\">People are brought into the loop, not left to find their way into it.</p>\n<p class=\"\" data-start=\"2011\" data-end=\"2186\">Fireplace transparency changes how a team feels. Just like a fireplace, it sets the tone of the space. Everyone benefits, even those who are not sitting closest to the source.</p>\n<hr class=\"\" data-start=\"2188\" data-end=\"2191\">\n<h3 class=\"\" data-start=\"2193\" data-end=\"2211\">Why It Matters</h3>\n<p class=\"\" data-start=\"2213\" data-end=\"2314\">In my work across product, strategy, and operations, I have seen how powerful this difference can be.</p>\n<p class=\"\" data-start=\"2316\" data-end=\"2557\">The best teams I’ve worked with are not always the ones with the most resources or the most polished plans. They are the ones who make sure everyone has shared context. Where people understand not just what they’re doing, but why it matters.</p>\n<p class=\"\" data-start=\"2559\" data-end=\"2686\">That kind of alignment is not a side effect. It is something you create. And you do it through systems, rhythm, and repetition.</p>\n<p class=\"\" data-start=\"2688\" data-end=\"2869\">Fireplace transparency takes more effort. It requires discipline and care. But it builds trust, connection, and momentum. It allows people to contribute with confidence and clarity.</p>\n<p class=\"\" data-start=\"2871\" data-end=\"3043\">I look for this kind of transparency. I try to create it where I work. And I believe it is one of the clearest signs of a team that truly understands how to build together.</p>",
            "author": {
                "name": "Chris Basson"
            },
            "tags": [
                   "culture",
                   "Posts"
            ],
            "date_published": "2025-04-23T12:07:14+02:00",
            "date_modified": "2025-04-23T12:08:57+02:00"
        },
        {
            "id": "https://chris.basson.io/what-kind-of-team-are-you-joining.html",
            "url": "https://chris.basson.io/what-kind-of-team-are-you-joining.html",
            "title": "What Kind of Team Are You Joining",
            "summary": "A Musical Analogy 🎺 Looking back, I’ve definitely failed some candidates. Not&hellip;",
            "content_html": "<h2 id=\"a-musical-analogy\">A Musical Analogy 🎺</h2>\n<p>Looking back, I’ve definitely failed some candidates. Not because they weren’t skilled or experienced. But because I didn’t ask the right questions about how they liked to work. I also wasn’t transparent enough about how my team actually worked, or what it needed at that point in time.<br><br>The problem wasn’t about capability. It was about alignment. When the way someone prefers to work doesn’t match how the team operates, it creates needless friction. That’s a mistake I’ve tried to avoid since.<br><br>At some point, I started thinking about teams in terms of jazz bands and orchestras. It’s not a perfect model, but it has helped me spot mismatches earlier and talk more clearly about what candidates can expect from the team they might join.</p>\n<hr>\n<h2 id=\"two-teams-two-modes\">Two Teams, Two Modes 🎼</h2>\n<p>Jazz teams are not chaotic or unplanned. They still use frameworks. They still write documentation. They still make time for planning and design.<br><br>What makes them different is how they treat structure. Jazz teams rely on shared awareness, quick adaptation, and fluid roles. They trust people to step into what is needed, often beyond their formal responsibilities. They learn by doing. They adjust quickly. There is often less formality, but more individual accountability.<br><br>Orchestral teams also deliver great work, but they rely on more defined processes. Roles are clear. Coordination is deliberate. Handovers and dependencies are mapped. Execution follows a shared plan, and success depends on everyone doing their part at the right time.<br><br>That does not mean orchestral teams are inflexible. But they tend to change direction more slowly, and only when the entire system is ready to move.<br><br>Both types of teams can be effective. The key is understanding which one you are in, or trying to build.</p>\n<h2 id=\"how-i-use-this-when-hiring\">How I Use This When Hiring 🧭</h2>\n<p>This lens has changed the way I approach interviews.<br><br>I try to understand what kind of environment the team is currently operating in. Some teams need people who can shape their own role and thrive with loose structure. Others need people who value clarity, process, and consistency.<br><br>When I talk to candidates, I try to give them a real picture of the day-to-day. I describe how we make decisions, how responsibilities are shared, how we communicate, and what kind of flexibility or structure they can expect.<br><br>I also ask questions like:<br><br>How do you like to work when priorities shift quickly? Do you enjoy building process or prefer working within an existing one? How do you feel about loosely defined responsibilities?<br><br>These questions help both sides assess whether the environment is a good match.</p>\n<h2 id=\"if-youre-a-candidate\">If You’re a Candidate 👤</h2>\n<p>You don’t have to fit into one category or the other. But it helps to know what kind of team brings out your best work.<br><br>Ask yourself:<br><br>Do I want more autonomy or more structure? Do I get energy from figuring things out as I go, or from executing against a clear plan? Do I want to shape my role, or focus deeply within a defined scope?<br><br>In interviews, try to go beyond the job title and project scope. Ask how the team works. Ask how they handle change. Ask what kind of collaboration and ownership is expected.<br><br>These questions will give you a much clearer picture than a job description ever can.</p>\n<h2 id=\"if-youre-a-hiring-manager\">If You’re a Hiring Manager 🧩</h2>\n<p>Be honest about how your team works today. Not how you want it to work. Not how the company says it works. Just how this particular group of people currently gets things done.<br><br>Then ask yourself: will the person I’m hiring be set up to succeed in that environment?<br><br>Some candidates thrive in fast-moving, lightly structured settings. Others do better in clearly defined, well-planned environments. Neither is better. But one is likely to be a better fit for what your team needs right now.<br><br>Making this visible helps everyone. It sets better expectations. It builds trust. And it reduces the risk of a misaligned hire.</p>\n<h2 id=\"a-final-thought\">A Final Thought 💡</h2>\n<p>Most teams are not purely one or the other. They sit somewhere in between. And they shift over time.<br><br>But thinking about teams in this way has helped me hire more thoughtfully and support my teams with better awareness of how they operate.<br><br>It has also helped me have better conversations with candidates. Instead of focusing only on skill, we also talk about how people work best, and what kind of team they want to be part of.<br><br>Have you worked on a team that felt more like jazz or more like an orchestra? How did that shape your experience? And how do you assess this kind of fit, whether you’re hiring or interviewing?<br><br>I would love to hear your perspective.</p>",
            "author": {
                "name": "Chris Basson"
            },
            "tags": [
                   "culture",
                   "Posts"
            ],
            "date_published": "2025-04-08T12:00:00+02:00",
            "date_modified": "2025-04-21T14:11:46+02:00"
        },
        {
            "id": "https://chris.basson.io/how-i-think-about-agile-kanban-and-the-rest.html",
            "url": "https://chris.basson.io/how-i-think-about-agile-kanban-and-the-rest.html",
            "title": "How I Think About Agile, Kanban, and the Rest",
            "summary": "There’s no shortage of \"frameworks\" in product development. Agile, Scrum, Kanban, Shape&hellip;",
            "content_html": "<p class=\"\" data-start=\"317\" data-end=\"430\">There’s no shortage of \"frameworks\" in product development. Agile, Scrum, Kanban, Shape Up, SAFe. The list goes on.</p>\n<p class=\"\" data-start=\"432\" data-end=\"497\">Each of them offers something. But none of them offer everything.</p>\n<p class=\"\" data-start=\"499\" data-end=\"698\">Over time, I’ve seen too many teams get stuck treating process as if it’s the work. They follow the steps, hold the ceremonies, tick the boxes. But something’s missing: Outcomes. Ownership. Judgment.</p>\n<p class=\"\" data-start=\"700\" data-end=\"939\">This post isn’t a teardown of process. It’s a reflection on how I’ve come to use frameworks in practice. What they’re good for, where they fall short, and why the most effective teams I’ve worked with treat methods as tools, not templates.</p>\n<hr class=\"\" data-start=\"941\" data-end=\"944\">\n<h3 class=\"\" data-start=\"946\" data-end=\"986\">Agile is a philosophy, not a process</h3>\n<p class=\"\" data-start=\"988\" data-end=\"1169\">A lot of teams say “we do Agile” when what they really mean is “we follow Scrum.” Standups, retros, sprints, story points. But Agile, in its original form, isn’t a framework at all.</p>\n<p class=\"\" data-start=\"1171\" data-end=\"1304\">It’s a set of values. A manifesto. A response to heavyweight processes that were too slow and too rigid for real-world software work.</p>\n<p class=\"\" data-start=\"1306\" data-end=\"1414\">Agile is about adapting quickly, working closely with users, focusing on outcomes, and shipping iteratively.</p>\n<p class=\"\" data-start=\"1416\" data-end=\"1554\">Scrum is one way to approach that. So is Kanban. So is Shape Up. And so is whatever hybrid a thoughtful team puts together for themselves.</p>\n<p class=\"\" data-start=\"1556\" data-end=\"1699\">The mistake is treating frameworks as fixed systems. When process becomes the product, teams start measuring success by completion, not impact.</p>\n<hr class=\"\" data-start=\"1701\" data-end=\"1704\">\n<h3 class=\"\" data-start=\"1706\" data-end=\"1751\">Delivery is only one part of product work</h3>\n<p class=\"\" data-start=\"1753\" data-end=\"1847\">Good product work can be broken up into three parts:</p>\n<ul>\n<li data-start=\"1851\" data-end=\"1894\">Strategy: deciding what problems to solve</li>\n<li data-start=\"1851\" data-end=\"1894\">Discovery: exploring and validating possible solutions</li>\n<li data-start=\"1956\" data-end=\"2005\">Delivery: building and shipping those solutions</li>\n</ul>\n<p class=\"\" data-start=\"2007\" data-end=\"2279\">Most delivery frameworks focus entirely on that last piece. And while structure and cadence are helpful, they can only take you so far. If you’re missing strategy, you risk building things that don’t matter. If you skip discovery, you risk shipping things that don’t work.</p>\n<p class=\"\" data-start=\"2281\" data-end=\"2384\">A team can sprint consistently, hit velocity targets, and still miss every opportunity to create value.</p>\n<hr class=\"\" data-start=\"2386\" data-end=\"2389\">\n<h3 class=\"\" data-start=\"2391\" data-end=\"2429\">What I’ve seen that actually works</h3>\n<p class=\"\" data-start=\"2431\" data-end=\"2640\">The best teams I’ve worked with aren’t the ones who followed a textbook. They’re the ones who stayed close to context. They chose their practices based on the team, the stage, and the problem in front of them.</p>\n<p class=\"\" data-start=\"2642\" data-end=\"2818\">In some cases, two-week sprints worked well. The rhythm helped us stay focused. In other cases, that same structure created unnecessary tension and encouraged shallow planning.</p>\n<p class=\"\" data-start=\"2820\" data-end=\"3015\">I’ve also worked with teams using Shape Up-style cycles. The longer blocks gave us time to breathe, but they only worked when paired with strong upfront shaping and a clear appetite for the work.</p>\n<p class=\"\" data-start=\"3017\" data-end=\"3278\">And then there were times, especially earlier in my career, when I got too caught up in process itself. I spent time designing clean systems, structuring ceremonies, and setting up beautiful flows of work. On paper, it was elegant. In practice, it was friction.</p>\n<p class=\"\" data-start=\"3280\" data-end=\"3658\">We had discipline. We had structure. But throughput was sluggish, and outcomes were nearly impossible to measure. The process looked right, but it didn’t serve the team we actually were at the time. The maturity of the product, the size of the team, and the realities of what needed to be delivered were all telling us to keep it simpler. I just wasn’t listening closely enough.</p>\n<p class=\"\" data-start=\"3660\" data-end=\"3771\">That experience stayed with me. It is why I now view process as something provisional. A tool, not an identity.</p>\n<hr class=\"\" data-start=\"3773\" data-end=\"3776\">\n<h3 class=\"\" data-start=\"3778\" data-end=\"3822\">Frameworks are tools, not belief systems</h3>\n<p class=\"\" data-start=\"3824\" data-end=\"3859\">This is the core of how I work now.</p>\n<p class=\"\" data-start=\"3861\" data-end=\"4121\">I look at process as something to support the work, not define it. I like to think that I have a toolbox which I can draw from, so that I pull out the appropriate tool for the task at hand. I talk with my team about what’s working and what isn’t. I keep what serves us and leave the rest behind.</p>\n<p class=\"\" data-start=\"4123\" data-end=\"4340\">None of this is radical. But it takes intention. It takes trust. And it takes a willingness to stop asking “Are we following the framework right?” and start asking “Are we solving the right problems in the right way?”</p>\n<p class=\"\" data-start=\"4342\" data-end=\"4495\">That shift changes how a team works together. It gives people the freedom to think critically. It encourages better questions. It invites better answers.</p>\n<hr class=\"\" data-start=\"4497\" data-end=\"4500\">\n<h3 class=\"\" data-start=\"4502\" data-end=\"4522\">To close this out</h3>\n<p class=\"\" data-start=\"4524\" data-end=\"4695\">Every framework carries value. But none of them will tell you what your users need, or how to solve a hard problem, or what your team needs in order to do their best work.</p>\n<p class=\"\" data-start=\"4697\" data-end=\"4811\">That kind of insight comes from context. It comes from listening. It comes from being willing to change your mind.</p>\n<p class=\"\" data-start=\"4813\" data-end=\"5016\">When process becomes the goal, you stop adapting. But when process is treated as a living toolset, you can build things that matter, work more confidently, and help your team move with clarity and focus.</p>\n<p class=\"\" data-start=\"5018\" data-end=\"5113\">That’s the kind of environment I want to build. Not one that’s perfectly Agile. One that works.</p>",
            "author": {
                "name": "Chris Basson"
            },
            "tags": [
                   "product",
                   "Posts"
            ],
            "date_published": "2021-11-04T20:42:00+02:00",
            "date_modified": "2025-04-23T12:50:58+02:00"
        },
        {
            "id": "https://chris.basson.io/work-life-dependencies-2.html",
            "url": "https://chris.basson.io/work-life-dependencies-2.html",
            "title": "Work-Life Dependencies",
            "summary": "A quick search on Medium will tell you that just about everybody&hellip;",
            "content_html": "<p>A quick search on Medium will tell you that just about everybody on the internet, and their pet fish, thinks that the idea of work-life balance is nonsensical. If this is the case how do we achieve success in both domains?</p>\n<p>Many of the aforementioned authors offer their perspective on how to achieve success in life alongside being a professional achiever. I struggled to identify with the examples used and felt as though I needed an underlying principle which could be more practically applied. As I have introspected on these suggestions and on my own moments of success, I have started thinking of the relationship between these two spaces in my life as a work-life dependency.</p>\n<h3><strong>Work-Life Dependency</strong></h3>\n<p>A quick recap on dependencies: I like to think of a dependency as a constraint-based relationship between two activities such that the success of one is reliant on the success the other.</p>\n<p>Building on this idea I think there are activities (or outcomes) in our personal lives that result in the success of activities (or outcomes) in our professional lives — and vice-versa. These activities are going to differ for each individual, but what is important is being able to identify them and focus on giving enough time to what’s most energizing in each space (work and personal life) so that it enables rather than blocks your success in the other.</p>\n<p>The illustration I would use from my life is the need for creative or ideative output in my professional life. If the balance of work I am doing shifts to the point where I have very limited creative or ideative responsibility, I struggle to feel adequately rested or relaxed in my personal life. If I am unable to find at least some uninterrupted time alone to process my thoughts over the weekend, I struggle to make meaningful contributions at work.</p>\n<h3><strong>What I am not Suggesting</strong></h3>\n<p>I am not suggesting it is possible to keep these important items in perfect alignment — rather that we should be making sure that we aren’t ignoring the activities or outcomes that are important to ensuring our overall success.</p>\n<p>There are always going to be times of pressure, where we have to cut back significantly to give focus to personal or professional endeavors. As I identify my own ‘key dependencies’, I find myself more able to ensure I am not going for weeks or months without keeping contributions flowing from the other side of the fence.</p>\n<h2><strong>Final Thoughts</strong></h2>\n<p>There is a dependency between work and personal life. They aren’t separate and they almost definitely can’t be balanced; one feeds the other, and by ignoring one you in fact harm the other. Find the activities in each which enable the other and make sure they don’t drop indefinitely.</p>\n<p><strong>This is an evolving idea of mine, shared as part of my personal development journey. I would love to hear your views, ideas and suggestions.</strong></p>",
            "author": {
                "name": "Chris Basson"
            },
            "tags": [
                   "productivity",
                   "Posts"
            ],
            "date_published": "2019-05-29T14:20:00+02:00",
            "date_modified": "2025-04-21T14:21:01+02:00"
        }
    ]
}
